<?xml version="1.0"?>
<GCC_XML cvs_revision="1.121">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _7 _8 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _23 _24 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _47 _48 _49 _51 _52 _53 _54 _55 _56 _57 _58 _25 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _70 _71 _72 _73 _74 _75 _76 _77 _46 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _149 _150 _151 _153 _154 _155 _156 _22 _157 _158 _159 _160 _161 _162 _163 _164 _165 _166 _167 _168 _2 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _148 _181 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _104 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _227 _228 _229 _230 _232 _233 _234 _235 _236 _237 _239 _240 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250 _251 _252 _253 _254 _255 _256 _257 _258 _259 _260 _261 _262 _263 _264 _265 _266 _267 _268 _9 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>

    <Argument name="device" type="_310" location="f1:308" file="f1" line="308"/>
    <Argument name="ordinal" type="_226" location="f1:308" file="f1" line="308"/>
  </Function>
  <Function id="_251" name="cuMemAllocPitch" returns="_145" context="_1" location="f1:363" file="f1" line="363" extern="1">
    <Argument name="dptr" type="_291" location="f1:363" file="f1" line="363"/>
    <Argument name="pPitch" type="_288" location="f1:363" file="f1" line="363"/>
    <Argument name="WidthInBytes" type="_125" location="f1:363" file="f1" line="363"/>
    <Argument name="Height" type="_125" location="f1:363" file="f1" line="363"/>
    <Argument name="ElementSizeBytes" type="_125" location="f1:363" file="f1" line="363"/>
  </Function>
  <Function id="_252" name="__builtin_ctzll" returns="_226" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_287" location="f0:98" file="f0" line="98"/>
  </Function>
  <Function id="_253" name="__builtin_cargf" returns="_272" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_289" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_254" name="__builtin_cargl" returns="_274" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_290" location="f0:95" file="f0" line="95"/>
  </Function>
  <Function id="_255" name="__builtin_cosf" returns="_272" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_272" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_256" name="__builtin_cosh" returns="_269" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_269" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_257" name="__builtin_cosl" returns="_274" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_274" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_258" name="cuMemsetD2D32" returns="_145" context="_1" location="f1:493" file="f1" line="493" extern="1">
    <Argument name="dstDevice" type="_126" location="f1:493" file="f1" line="493"/>
    <Argument name="dstPitch" type="_125" location="f1:493" file="f1" line="493"/>
    <Argument name="ui" type="_125" location="f1:493" file="f1" line="493"/>
    <Argument name="Width" type="_125" location="f1:493" file="f1" line="493"/>
    <Argument name="Height" type="_125" location="f1:493" file="f1" line="493"/>
  </Function>
  <Function id="_259" name="cuEventCreate" returns="_145" context="_1" location="f1:617" file="f1" line="617" extern="1">
    <Argument name="phEvent" type="_369" location="f1:617" file="f1" line="617"/>
    <Argument name="Flags" type="_125" location="f1:617" file="f1" line="617"/>
  </Function>
  <Function id="_260" name="cuModuleUnload" returns="_145" context="_1" location="f1:342" file="f1" line="342" extern="1">
    <Argument name="hmod" type="_239" location="f1:342" file="f1" line="342"/>
  </Function>
  <Function id="_261" name="cuCtxPopCurrent" returns="_145" context="_1" location="f1:327" file="f1" line="327" extern="1">
    <Argument name="pctx" type="_365" location="f1:327" file="f1" line="327"/>
  </Function>
  <Function id="_262" name="cuParamSeti" returns="_145" context="_1" location="f1:594" file="f1" line="594" extern="1">
    <Argument name="hfunc" type="_51" location="f1:594" file="f1" line="594"/>
    <Argument name="offset" type="_226" location="f1:594" file="f1" line="594"/>
    <Argument name="value" type="_125" location="f1:594" file="f1" line="594"/>
  </Function>
  <Function id="_263" name="cuParamSetv" returns="_145" context="_1" location="f1:596" file="f1" line="596" extern="1">
    <Argument name="hfunc" type="_51" location="f1:596" file="f1" line="596"/>
    <Argument name="offset" type="_226" location="f1:596" file="f1" line="596"/>
    <Argument name="ptr" type="_293" location="f1:596" file="f1" line="596"/>
    <Argument name="numbytes" type="_125" location="f1:596" file="f1" line="596"/>
  </Function>
  <Function id="_264" name="cuParamSetTexRef" returns="_145" context="_1" location="f1:597" file="f1" line="597" extern="1">
    <Argument name="hfunc" type="_51" location="f1:597" file="f1" line="597"/>
    <Argument name="texunit" type="_226" location="f1:597" file="f1" line="597"/>
    <Argument name="hTexRef" type="_183" location="f1:597" file="f1" line="597"/>
  </Function>
  <Function id="_265" name="__builtin_sinf" returns="_272" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_272" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_266" name="__builtin_sinh" returns="_269" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_269" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_267" name="__builtin_sinl" returns="_274" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_274" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_268" name="__builtin_csin" returns="_292" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_292" location="f0:115" file="f0" line="115"/>
  </Function>
  <FundamentalType id="_269" name="double" size="64" align="64"/>
  <PointerType id="_270" type="_370c" size="64" align="64"/>
  <PointerType id="_271" type="_23" size="64" align="64"/>
  <FundamentalType id="_272" name="float" size="32" align="32"/>
  <PointerType id="_273" type="_47c" size="64" align="64"/>
  <FundamentalType id="_274" name="long double" size="128" align="128"/>
  <Field id="_275" name="maxThreadsPerBlock" type="_226" offset="0" context="_8" access="public" location="f1:141" file="f1" line="141"/>
  <Field id="_276" name="maxThreadsDim" type="_373" offset="32" context="_8" access="public" location="f1:142" file="f1" line="142"/>
  <Field id="_277" name="maxGridSize" type="_373" offset="128" context="_8" access="public" location="f1:143" file="f1" line="143"/>
  <Field id="_278" name="sharedMemPerBlock" type="_226" offset="224" context="_8" access="public" location="f1:144" file="f1" line="144"/>
  <Field id="_279" name="totalConstantMemory" type="_226" offset="256" context="_8" access="public" location="f1:145" file="f1" line="145"/>
  <Field id="_280" name="SIMDWidth" type="_226" offset="288" context="_8" access="public" location="f1:146" file="f1" line="146"/>
  <Field id="_281" name="memPitch" type="_226" offset="320" context="_8" access="public" location="f1:147" file="f1" line="147"/>
  <Field id="_282" name="regsPerBlock" type="_226" offset="352" context="_8" access="public" location="f1:148" file="f1" line="148"/>
  <Field id="_283" name="clockRate" type="_226" offset="384" context="_8" access="public" location="f1:149" file="f1" line="149"/>
  <Field id="_284" name="textureAlign" type="_226" offset="416" context="_8" access="public" location="f1:150" file="f1" line="150"/>
  <PointerType id="_285" type="_239" size="64" align="64"/>
  <PointerType id="_286" type="_338c" size="64" align="64"/>
  <FundamentalType id="_287" name="long long int" size="64" align="64"/>
  <PointerType id="_288" type="_125" size="64" align="64"/>
  <FundamentalType id="_289" name="complex float" size="64" align="32"/>
  <FundamentalType id="_290" name="complex long double" size="256" align="128"/>
  <PointerType id="_291" type="_126" size="64" align="64"/>
  <FundamentalType id="_292" name="complex double" size="128" align="64"/>
  <PointerType id="_293" type="_338" size="64" align="64"/>
  <Field id="_294" name="srcXInBytes" type="_125" offset="0" context="_46" access="public" location="f1:402" file="f1" line="402"/>
  <Field id="_295" name="srcY" type="_125" offset="32" context="_46" access="public" location="f1:402" file="f1" line="402"/>
  <Field id="_296" name="srcMemoryType" type="_26" offset="64" context="_46" access="public" location="f1:403" file="f1" line="403"/>
  <Field id="_297" name="srcHost" type="_286" offset="128" context="_46" access="public" location="f1:404" file="f1" line="404"/>
  <Field id="_298" name="srcDevice" type="_126" offset="192" context="_46" access="public" location="f1:405" file="f1" line="405"/>
  <Field id="_299" name="srcArray" type="_153" offset="256" context="_46" access="public" location="f1:406" file="f1" line="406"/>
  <Field id="_300" name="srcPitch" type="_125" offset="320" context="_46" access="public" location="f1:407" file="f1" line="407"/>
  <Field id="_301" name="dstXInBytes" type="_125" offset="352" context="_46" access="public" location="f1:409" file="f1" line="409"/>
  <Field id="_302" name="dstY" type="_125" offset="384" context="_46" access="public" location="f1:409" file="f1" line="409"/>
  <Field id="_303" name="dstMemoryType" type="_26" offset="416" context="_46" access="public" location="f1:410" file="f1" line="410"/>
  <Field id="_304" name="dstHost" type="_293" offset="448" context="_46" access="public" location="f1:411" file="f1" line="411"/>
  <Field id="_305" name="dstDevice" type="_126" offset="512" context="_46" access="public" location="f1:412" file="f1" line="412"/>
  <Field id="_306" name="dstArray" type="_153" offset="576" context="_46" access="public" location="f1:413" file="f1" line="413"/>
  <Field id="_307" name="dstPitch" type="_125" offset="640" context="_46" access="public" location="f1:414" file="f1" line="414"/>
  <Field id="_308" name="WidthInBytes" type="_125" offset="672" context="_46" access="public" location="f1:416" file="f1" line="416"/>
  <Field id="_309" name="Height" type="_125" offset="704" context="_46" access="public" location="f1:417" file="f1" line="417"/>
  <PointerType id="_310" type="_227" size="64" align="64"/>
  <PointerType id="_311" type="_153" size="64" align="64"/>
  <PointerType id="_312" type="_169c" size="64" align="64"/>
  <Field id="_313" name="srcXInBytes" type="_125" offset="0" context="_56" access="public" location="f1:426" file="f1" line="426"/>
  <Field id="_314" name="srcY" type="_125" offset="32" context="_56" access="public" location="f1:426" file="f1" line="426"/>
  <Field id="_315" name="srcZ" type="_125" offset="64" context="_56" access="public" location="f1:426" file="f1" line="426"/>
  <Field id="_316" name="srcLOD" type="_125" offset="96" context="_56" access="public" location="f1:427" file="f1" line="427"/>
  <Field id="_317" name="srcMemoryType" type="_26" offset="128" context="_56" access="public" location="f1:428" file="f1" line="428"/>
  <Field id="_318" name="srcHost" type="_286" offset="192" context="_56" access="public" location="f1:429" file="f1" line="429"/>
  <Field id="_319" name="srcDevice" type="_126" offset="256" context="_56" access="public" location="f1:430" file="f1" line="430"/>
  <Field id="_320" name="srcArray" type="_153" offset="320" context="_56" access="public" location="f1:431" file="f1" line="431"/>
  <Field id="_321" name="reserved0" type="_293" offset="384" context="_56" access="public" location="f1:432" file="f1" line="432"/>
  <Field id="_322" name="srcPitch" type="_125" offset="448" context="_56" access="public" location="f1:433" file="f1" line="433"/>
  <Field id="_323" name="srcHeight" type="_125" offset="480" context="_56" access="public" location="f1:434" file="f1" line="434"/>
  <Field id="_324" name="dstXInBytes" type="_125" offset="512" context="_56" access="public" location="f1:436" file="f1" line="436"/>
  <Field id="_325" name="dstY" type="_125" offset="544" context="_56" access="public" location="f1:436" file="f1" line="436"/>
  <Field id="_326" name="dstZ" type="_125" offset="576" context="_56" access="public" location="f1:436" file="f1" line="436"/>
  <Field id="_327" name="dstLOD" type="_125" offset="608" context="_56" access="public" location="f1:437" file="f1" line="437"/>
  <Field id="_328" name="dstMemoryType" type="_26" offset="640" context="_56" access="public" location="f1:438" file="f1" line="438"/>
  <Field id="_329" name="dstHost" type="_293" offset="704" context="_56" access="public" location="f1:439" file="f1" line="439"/>
  <Field id="_330" name="dstDevice" type="_126" offset="768" context="_56" access="public" location="f1:440" file="f1" line="440"/>
  <Field id="_331" name="dstArray" type="_153" offset="832" context="_56" access="public" location="f1:441" file="f1" line="441"/>
  <Field id="_332" name="reserved1" type="_293" offset="896" context="_56" access="public" location="f1:442" file="f1" line="442"/>
  <Field id="_333" name="dstPitch" type="_125" offset="960" context="_56" access="public" location="f1:443" file="f1" line="443"/>
  <Field id="_334" name="dstHeight" type="_125" offset="992" context="_56" access="public" location="f1:444" file="f1" line="444"/>
  <Field id="_335" name="WidthInBytes" type="_125" offset="1024" context="_56" access="public" location="f1:446" file="f1" line="446"/>
  <Field id="_336" name="Height" type="_125" offset="1056" context="_56" access="public" location="f1:447" file="f1" line="447"/>
  <Field id="_337" name="Depth" type="_125" offset="1088" context="_56" access="public" location="f1:448" file="f1" line="448"/>
  <FundamentalType id="_338" name="void" align="8"/>
  <PointerType id="_339" type="_226" size="64" align="64"/>
  <FundamentalType id="_340" name="unsigned char" size="8" align="8"/>
  <PointerType id="_341" type="_186" size="64" align="64"/>
  <PointerType id="_342" type="_243" size="64" align="64"/>
  <PointerType id="_343" type="_370" size="64" align="64"/>
  <PointerType id="_344" type="_169" size="64" align="64"/>
  <PointerType id="_345" type="_51" size="64" align="64"/>
  <PointerType id="_346" type="_79" size="64" align="64"/>
  <FundamentalType id="_347" name="long int" size="64" align="64"/>
  <FundamentalType id="_348" name="short unsigned int" size="16" align="16"/>
  <PointerType id="_349" type="_272" size="64" align="64"/>
  <PointerType id="_350" type="_274" size="64" align="64"/>
  <PointerType id="_351" type="_199c" size="64" align="64"/>
  <PointerType id="_352" type="_210" size="64" align="64"/>
  <PointerType id="_353" type="_183" size="64" align="64"/>
  <Field id="_354" name="Width" type="_125" offset="0" context="_169" access="public" location="f1:516" file="f1" line="516"/>
  <Field id="_355" name="Height" type="_125" offset="32" context="_169" access="public" location="f1:517" file="f1" line="517"/>
  <Field id="_356" name="Format" type="_186" offset="64" context="_169" access="public" location="f1:522" file="f1" line="522"/>
  <Field id="_357" name="NumChannels" type="_125" offset="96" context="_169" access="public" location="f1:525" file="f1" line="525"/>
  <Field id="_358" name="Width" type="_125" offset="0" context="_170" access="public" location="f1:537" file="f1" line="537"/>
  <Field id="_359" name="Height" type="_125" offset="32" context="_170" access="public" location="f1:538" file="f1" line="538"/>
  <Field id="_360" name="Depth" type="_125" offset="64" context="_170" access="public" location="f1:539" file="f1" line="539"/>
  <Field id="_361" name="Format" type="_186" offset="96" context="_170" access="public" location="f1:543" file="f1" line="543"/>
  <Field id="_362" name="NumChannels" type="_125" offset="128" context="_170" access="public" location="f1:546" file="f1" line="546"/>
  <Field id="_363" name="Flags" type="_125" offset="160" context="_170" access="public" location="f1:550" file="f1" line="550"/>
  <PointerType id="_364" type="_170" size="64" align="64"/>
  <PointerType id="_365" type="_232" size="64" align="64"/>
  <PointerType id="_366" type="_170c" size="64" align="64"/>
  <PointerType id="_367" type="_293" size="64" align="64"/>
  <PointerType id="_368" type="_105" size="64" align="64"/>
  <PointerType id="_369" type="_70" size="64" align="64"/>
  <ArrayType id="_373" min="0" max="2u" type="_226" size="96" align="32"/>
  <FundamentalType id="_370" name="char" size="8" align="8"/>
  <CvQualifiedType id="_370c" type="_370" const="1"/>
  <CvQualifiedType id="_338c" type="_338" const="1"/>
  <CvQualifiedType id="_47c" type="_47" const="1"/>
  <CvQualifiedType id="_199c" type="_199" const="1"/>
  <CvQualifiedType id="_169c" type="_169" const="1"/>
  <CvQualifiedType id="_170c" type="_170" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.1/gccxml_builtins.h"/>
  <File id="f1" name="/usr/local/cuda/include/cuda.h"/>
  <CPP_DUMP name="functions"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="aliases"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="excluded"><![CDATA[]]></CPP_DUMP>
</GCC_XML>
