<?xml version="1.0"?>
<GCC_XML cvs_revision="1.121">

    <Argument name="C" type="_818" location="f2:3900" file="f2" line="3900"/>
    <Argument name="ldc" type="_807" location="f2:3900" file="f2" line="3900"/>
  </Function>
  <Function id="_792" name="cublasStrmm" returns="_806" context="_1" location="f2:2551" file="f2" line="2551" extern="1">
    <Argument name="side" type="_816" location="f2:2551" file="f2" line="2551"/>
    <Argument name="uplo" type="_816" location="f2:2551" file="f2" line="2551"/>
    <Argument name="transa" type="_816" location="f2:2551" file="f2" line="2551"/>
    <Argument name="diag" type="_816" location="f2:2551" file="f2" line="2551"/>
    <Argument name="m" type="_807" location="f2:2551" file="f2" line="2551"/>
    <Argument name="n" type="_807" location="f2:2551" file="f2" line="2551"/>
    <Argument name="alpha" type="_264" location="f2:2551" file="f2" line="2551"/>
    <Argument name="A" type="_808" location="f2:2551" file="f2" line="2551"/>
    <Argument name="lda" type="_807" location="f2:2551" file="f2" line="2551"/>
    <Argument name="B" type="_809" location="f2:2551" file="f2" line="2551"/>
    <Argument name="ldb" type="_807" location="f2:2551" file="f2" line="2551"/>
  </Function>
  <Function id="_793" name="cublasStrmv" returns="_806" context="_1" location="f2:2053" file="f2" line="2053" extern="1">
    <Argument name="uplo" type="_816" location="f2:2053" file="f2" line="2053"/>
    <Argument name="trans" type="_816" location="f2:2053" file="f2" line="2053"/>
    <Argument name="diag" type="_816" location="f2:2053" file="f2" line="2053"/>
    <Argument name="n" type="_807" location="f2:2053" file="f2" line="2053"/>
    <Argument name="A" type="_808" location="f2:2053" file="f2" line="2053"/>
    <Argument name="lda" type="_807" location="f2:2053" file="f2" line="2053"/>
    <Argument name="x" type="_809" location="f2:2053" file="f2" line="2053"/>
    <Argument name="incx" type="_807" location="f2:2053" file="f2" line="2053"/>
  </Function>
  <Function id="_794" name="__builtin_csin" returns="_831" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_831" location="f0:115" file="f0" line="115"/>
  </Function>
  <Function id="_795" name="__copysignf" returns="_264" throw="" context="_1" location="f1:218" file="f1" line="218" extern="1" attributes="const">
    <Argument name="__x" type="_264" location="f1:218" file="f1" line="218"/>
    <Argument name="__y" type="_264" location="f1:218" file="f1" line="218"/>
  </Function>
  <Function id="_796" name="__copysignl" returns="_805" throw="" context="_1" location="f1:218" file="f1" line="218" extern="1" attributes="const">
    <Argument name="__x" type="_805" location="f1:218" file="f1" line="218"/>
    <Argument name="__y" type="_805" location="f1:218" file="f1" line="218"/>
  </Function>
  <Function id="_797" name="fabsf" returns="_264" throw="" context="_1" location="f1:182" file="f1" line="182" extern="1" attributes="nothrow const">
    <Argument name="__x" type="_264" location="f1:182" file="f1" line="182"/>
  </Function>
  <Function id="_798" name="fabsl" returns="_805" throw="" context="_1" location="f1:182" file="f1" line="182" extern="1" attributes="nothrow const">
    <Argument name="__x" type="_805" location="f1:182" file="f1" line="182"/>
  </Function>
  <Struct id="_799" name="longlong1" context="_1" mangled="9longlong1" demangled="longlong1" location="f4:287" file="f4" line="287" artificial="1" size="64" align="64" members="_927 " bases=""/>
  <Typedef id="_800" name="longlong1" type="_799" context="_1" location="f4:400" file="f4" line="400"/>
  <Struct id="_801" name="longlong2" context="_1" mangled="9longlong2" demangled="longlong2" location="f4:299" file="f4" line="299" artificial="1" size="128" align="64" members="_928 _929 " bases=""/>
  <Typedef id="_802" name="longlong2" type="_801" context="_1" location="f4:404" file="f4" line="404"/>
  <Function id="_803" name="cublasSgemm" returns="_806" context="_1" location="f2:2235" file="f2" line="2235" extern="1">
    <Argument name="transa" type="_816" location="f2:2235" file="f2" line="2235"/>
    <Argument name="transb" type="_816" location="f2:2235" file="f2" line="2235"/>
    <Argument name="m" type="_807" location="f2:2235" file="f2" line="2235"/>
    <Argument name="n" type="_807" location="f2:2235" file="f2" line="2235"/>
    <Argument name="k" type="_807" location="f2:2235" file="f2" line="2235"/>
    <Argument name="alpha" type="_264" location="f2:2235" file="f2" line="2235"/>
    <Argument name="A" type="_808" location="f2:2235" file="f2" line="2235"/>
    <Argument name="lda" type="_807" location="f2:2235" file="f2" line="2235"/>
    <Argument name="B" type="_808" location="f2:2235" file="f2" line="2235"/>
    <Argument name="ldb" type="_807" location="f2:2235" file="f2" line="2235"/>
    <Argument name="beta" type="_264" location="f2:2235" file="f2" line="2235"/>
    <Argument name="C" type="_809" location="f2:2235" file="f2" line="2235"/>
    <Argument name="ldc" type="_807" location="f2:2235" file="f2" line="2235"/>
  </Function>
  <PointerType id="_804" type="_816c" size="64" align="64"/>
  <FundamentalType id="_805" name="long double" size="128" align="128"/>
  <FundamentalType id="_806" name="void" align="8"/>
  <FundamentalType id="_807" name="int" size="32" align="32"/>
  <PointerType id="_808" type="_264c" size="64" align="64"/>
  <PointerType id="_809" type="_264" size="64" align="64"/>
  <PointerType id="_810" type="_807" size="64" align="64"/>
  <FundamentalType id="_811" name="long long int" size="64" align="64"/>
  <FundamentalType id="_812" name="complex float" size="64" align="32"/>
  <FundamentalType id="_813" name="complex long double" size="256" align="128"/>
  <PointerType id="_814" type="_531c" size="64" align="64"/>
  <PointerType id="_815" type="_531" size="64" align="64"/>
  <FundamentalType id="_816" name="char" size="8" align="8"/>
  <PointerType id="_817" type="_237c" size="64" align="64"/>
  <PointerType id="_818" type="_237" size="64" align="64"/>
  <Field id="_819" name="x" type="_508" offset="0" context="_34" access="public" location="f4:158" file="f4" line="158"/>
  <Field id="_820" name="x" type="_508" offset="0" context="_36" access="public" location="f4:170" file="f4" line="170"/>
  <Field id="_821" name="y" type="_508" offset="32" context="_36" access="public" location="f4:170" file="f4" line="170"/>
  <Field id="_822" name="x" type="_508" offset="0" context="_38" access="public" location="f4:182" file="f4" line="182"/>
  <Field id="_823" name="y" type="_508" offset="32" context="_38" access="public" location="f4:182" file="f4" line="182"/>
  <Field id="_824" name="z" type="_508" offset="64" context="_38" access="public" location="f4:182" file="f4" line="182"/>
  <Constructor id="_825" name="uint3" artificial="1" throw="" context="_38" access="public" mangled="_ZN5uint3C1ERKS_ *INTERNAL* " demangled="uint3::uint3(uint3 const&amp;)" location="f4:181" file="f4" line="181" inline="1">
    <Argument type="_934" location="f4:428" file="f4" line="428"/>
  </Constructor>
  <Constructor id="_826" name="uint3" artificial="1" throw="" context="_38" access="public" mangled="_ZN5uint3C1Ev *INTERNAL* " demangled="uint3::uint3()" location="f4:181" file="f4" line="181" inline="1"/>
  <Field id="_827" name="x" type="_508" offset="0" context="_40" access="public" location="f4:194" file="f4" line="194"/>
  <Field id="_828" name="y" type="_508" offset="32" context="_40" access="public" location="f4:194" file="f4" line="194"/>
  <Field id="_829" name="z" type="_508" offset="64" context="_40" access="public" location="f4:194" file="f4" line="194"/>
  <Field id="_830" name="w" type="_508" offset="96" context="_40" access="public" location="f4:194" file="f4" line="194"/>
  <FundamentalType id="_831" name="complex double" size="128" align="64"/>
  <PointerType id="_832" type="_805" size="64" align="64"/>
  <Field id="_833" name="x" type="_935" offset="0" context="_112" access="public" location="f4:206" file="f4" line="206"/>
  <Field id="_834" name="x" type="_237" offset="0" context="_118" access="public" location="f4:318" file="f4" line="318"/>
  <Field id="_835" name="y" type="_237" offset="64" context="_118" access="public" location="f4:318" file="f4" line="318"/>
  <Constructor id="_836" name="double2" artificial="1" throw="" context="_118" access="public" mangled="_ZN7double2C1ERKS_ *INTERNAL* " demangled="double2::double2(double2 const&amp;)" location="f4:317" file="f4" line="317" inline="1">
    <Argument type="_936" location="f3:290" file="f3" line="290"/>
  </Constructor>
  <Constructor id="_837" name="double2" artificial="1" throw="" context="_118" access="public" mangled="_ZN7double2C1Ev *INTERNAL* " demangled="double2::double2()" location="f4:317" file="f4" line="317" inline="1"/>
  <Field id="_838" name="x" type="_508" offset="0" context="_142" access="public" location="f4:424" file="f4" line="424"/>
  <Field id="_839" name="y" type="_508" offset="32" context="_142" access="public" location="f4:424" file="f4" line="424"/>
  <Field id="_840" name="z" type="_508" offset="64" context="_142" access="public" location="f4:424" file="f4" line="424"/>
  <Constructor id="_841" name="dim3" context="_142" access="public" mangled="_ZN4dim3C1Ejjj *INTERNAL* " demangled="dim3::dim3(unsigned int, unsigned int, unsigned int)" location="f4:426" file="f4" line="426" endline="426" inline="1">
    <Argument name="x" type="_508" location="f4:426" file="f4" line="426" default="1"/>
    <Argument name="y" type="_508" location="f4:426" file="f4" line="426" default="1"/>
    <Argument name="z" type="_508" location="f4:426" file="f4" line="426" default="1"/>
  </Constructor>
  <Constructor id="_842" name="dim3" context="_142" access="public" mangled="_ZN4dim3C1E5uint3 *INTERNAL* " demangled="dim3::dim3(uint3)" location="f4:427" file="f4" line="427" endline="427" inline="1">
    <Argument name="v" type="_39" location="f4:427" file="f4" line="427"/>
  </Constructor>
  <Field id="_844" name="x" type="_935" offset="0" context="_160" access="public" location="f4:230" file="f4" line="230"/>
  <Field id="_845" name="y" type="_935" offset="64" context="_160" access="public" location="f4:230" file="f4" line="230"/>
  <PointerType id="_846" type="_806" size="64" align="64"/>
  <Field id="_847" name="x" type="_264" offset="0" context="_191" access="public" location="f4:264" file="f4" line="264"/>
  <Field id="_848" name="x" type="_264" offset="0" context="_193" access="public" location="f4:270" file="f4" line="270"/>
  <Field id="_849" name="y" type="_264" offset="32" context="_193" access="public" location="f4:270" file="f4" line="270"/>
  <Constructor id="_850" name="float2" artificial="1" throw="" context="_193" access="public" mangled="_ZN6float2C1ERKS_ *INTERNAL* " demangled="float2::float2(float2 const&amp;)" location="f4:269" file="f4" line="269" inline="1">
    <Argument type="_937" location="f3:180" file="f3" line="180"/>
  </Constructor>
  <Constructor id="_851" name="float2" artificial="1" throw="" context="_193" access="public" mangled="_ZN6float2C1Ev *INTERNAL* " demangled="float2::float2()" location="f4:269" file="f4" line="269" inline="1"/>
  <Field id="_852" name="x" type="_264" offset="0" context="_195" access="public" location="f4:276" file="f4" line="276"/>
  <Field id="_853" name="y" type="_264" offset="32" context="_195" access="public" location="f4:276" file="f4" line="276"/>
  <Field id="_854" name="z" type="_264" offset="64" context="_195" access="public" location="f4:276" file="f4" line="276"/>
  <Field id="_855" name="x" type="_264" offset="0" context="_197" access="public" location="f4:282" file="f4" line="282"/>
  <Field id="_856" name="y" type="_264" offset="32" context="_197" access="public" location="f4:282" file="f4" line="282"/>
  <Field id="_857" name="z" type="_264" offset="64" context="_197" access="public" location="f4:282" file="f4" line="282"/>
  <Field id="_858" name="w" type="_264" offset="96" context="_197" access="public" location="f4:282" file="f4" line="282"/>
  <Field id="_859" name="type" type="_807" offset="0" context="_208" access="public" location="f5:312" file="f5" line="312"/>
  <Field id="_860" name="name" type="_938" offset="64" context="_208" access="public" location="f5:313" file="f5" line="313"/>
  <Field id="_861" name="arg1" type="_237" offset="128" context="_208" access="public" location="f5:314" file="f5" line="314"/>
  <Field id="_862" name="arg2" type="_237" offset="192" context="_208" access="public" location="f5:315" file="f5" line="315"/>
  <Field id="_863" name="retval" type="_237" offset="256" context="_208" access="public" location="f5:316" file="f5" line="316"/>
  <FundamentalType id="_864" name="long int" size="64" align="64"/>
  <PointerType id="_865" type="_119c" size="64" align="64"/>
  <PointerType id="_866" type="_119" size="64" align="64"/>
  <PointerType id="_867" type="_806c" size="64" align="64"/>
  <Field id="_868" name="x" type="_807" offset="0" context="_275" access="public" location="f4:152" file="f4" line="152"/>
  <Field id="_869" name="x" type="_807" offset="0" context="_277" access="public" location="f4:164" file="f4" line="164"/>
  <Field id="_870" name="y" type="_807" offset="32" context="_277" access="public" location="f4:164" file="f4" line="164"/>
  <Field id="_871" name="x" type="_807" offset="0" context="_279" access="public" location="f4:188" file="f4" line="188"/>
  <Field id="_872" name="y" type="_807" offset="32" context="_279" access="public" location="f4:188" file="f4" line="188"/>
  <Field id="_873" name="z" type="_807" offset="64" context="_279" access="public" location="f4:188" file="f4" line="188"/>
  <Field id="_874" name="w" type="_807" offset="96" context="_279" access="public" location="f4:188" file="f4" line="188"/>
  <Field id="_875" name="x" type="_237" offset="0" context="_306" access="public" location="f4:312" file="f4" line="312"/>
  <Field id="_876" name="x" type="_941" offset="0" context="_311" access="public" location="f4:110" file="f4" line="110"/>
  <Field id="_877" name="x" type="_941" offset="0" context="_313" access="public" location="f4:122" file="f4" line="122"/>
  <Field id="_878" name="y" type="_941" offset="16" context="_313" access="public" location="f4:122" file="f4" line="122"/>
  <Field id="_879" name="x" type="_941" offset="0" context="_315" access="public" location="f4:134" file="f4" line="134"/>
  <Field id="_880" name="y" type="_941" offset="16" context="_315" access="public" location="f4:134" file="f4" line="134"/>
  <Field id="_881" name="z" type="_941" offset="32" context="_315" access="public" location="f4:134" file="f4" line="134"/>
  <Field id="_882" name="x" type="_941" offset="0" context="_317" access="public" location="f4:146" file="f4" line="146"/>
  <Field id="_883" name="y" type="_941" offset="16" context="_317" access="public" location="f4:146" file="f4" line="146"/>
  <Field id="_884" name="z" type="_941" offset="32" context="_317" access="public" location="f4:146" file="f4" line="146"/>
  <Field id="_885" name="w" type="_941" offset="48" context="_317" access="public" location="f4:146" file="f4" line="146"/>
  <Field id="_886" name="x" type="_942" offset="0" context="_339" access="public" location="f4:104" file="f4" line="104"/>
  <Field id="_887" name="x" type="_942" offset="0" context="_341" access="public" location="f4:116" file="f4" line="116"/>
  <Field id="_888" name="y" type="_942" offset="16" context="_341" access="public" location="f4:116" file="f4" line="116"/>
  <Field id="_889" name="x" type="_942" offset="0" context="_343" access="public" location="f4:140" file="f4" line="140"/>
  <Field id="_890" name="y" type="_942" offset="16" context="_343" access="public" location="f4:140" file="f4" line="140"/>
  <Field id="_891" name="z" type="_942" offset="32" context="_343" access="public" location="f4:140" file="f4" line="140"/>
  <Field id="_892" name="w" type="_942" offset="48" context="_343" access="public" location="f4:140" file="f4" line="140"/>
  <Field id="_893" name="x" type="_943" offset="0" context="_347" access="public" location="f4:56" file="f4" line="56"/>
  <Field id="_894" name="x" type="_943" offset="0" context="_349" access="public" location="f4:68" file="f4" line="68"/>
  <Field id="_895" name="y" type="_943" offset="8" context="_349" access="public" location="f4:68" file="f4" line="68"/>
  <Field id="_896" name="x" type="_943" offset="0" context="_351" access="public" location="f4:80" file="f4" line="80"/>
  <Field id="_897" name="y" type="_943" offset="8" context="_351" access="public" location="f4:80" file="f4" line="80"/>
  <Field id="_898" name="z" type="_943" offset="16" context="_351" access="public" location="f4:80" file="f4" line="80"/>
  <Field id="_899" name="x" type="_943" offset="0" context="_353" access="public" location="f4:92" file="f4" line="92"/>
  <Field id="_900" name="y" type="_943" offset="8" context="_353" access="public" location="f4:92" file="f4" line="92"/>
  <Field id="_901" name="z" type="_943" offset="16" context="_353" access="public" location="f4:92" file="f4" line="92"/>
  <Field id="_902" name="w" type="_943" offset="24" context="_353" access="public" location="f4:92" file="f4" line="92"/>
  <Field id="_903" name="x" type="_944" offset="0" context="_360" access="public" location="f4:294" file="f4" line="294"/>
  <Field id="_904" name="x" type="_807" offset="0" context="_443" access="public" location="f4:176" file="f4" line="176"/>
  <Field id="_905" name="y" type="_807" offset="32" context="_443" access="public" location="f4:176" file="f4" line="176"/>
  <Field id="_906" name="z" type="_807" offset="64" context="_443" access="public" location="f4:176" file="f4" line="176"/>
  <Field id="_907" name="x" type="_942" offset="0" context="_467" access="public" location="f4:128" file="f4" line="128"/>
  <Field id="_908" name="y" type="_942" offset="16" context="_467" access="public" location="f4:128" file="f4" line="128"/>
  <Field id="_909" name="z" type="_942" offset="32" context="_467" access="public" location="f4:128" file="f4" line="128"/>
  <Field id="_910" name="x" type="_945" offset="0" context="_554" access="public" location="f4:98" file="f4" line="98"/>
  <Field id="_911" name="y" type="_945" offset="8" context="_554" access="public" location="f4:98" file="f4" line="98"/>
  <Field id="_912" name="z" type="_945" offset="16" context="_554" access="public" location="f4:98" file="f4" line="98"/>
  <Field id="_913" name="w" type="_945" offset="24" context="_554" access="public" location="f4:98" file="f4" line="98"/>
  <PointerType id="_914" type="_208" size="64" align="64"/>
  <Field id="_915" name="x" type="_864" offset="0" context="_625" access="public" location="f4:200" file="f4" line="200"/>
  <Field id="_916" name="x" type="_864" offset="0" context="_627" access="public" location="f4:218" file="f4" line="218"/>
  <Field id="_917" name="y" type="_864" offset="64" context="_627" access="public" location="f4:218" file="f4" line="218"/>
  <PointerType id="_918" type="_846" size="64" align="64"/>
  <Field id="_919" name="x" type="_945" offset="0" context="_646" access="public" location="f4:62" file="f4" line="62"/>
  <Field id="_920" name="x" type="_945" offset="0" context="_648" access="public" location="f4:74" file="f4" line="74"/>
  <Field id="_921" name="y" type="_945" offset="8" context="_648" access="public" location="f4:74" file="f4" line="74"/>
  <Field id="_922" name="x" type="_945" offset="0" context="_650" access="public" location="f4:86" file="f4" line="86"/>
  <Field id="_923" name="y" type="_945" offset="8" context="_650" access="public" location="f4:86" file="f4" line="86"/>
  <Field id="_924" name="z" type="_945" offset="16" context="_650" access="public" location="f4:86" file="f4" line="86"/>
  <Field id="_925" name="x" type="_944" offset="0" context="_717" access="public" location="f4:306" file="f4" line="306"/>
  <Field id="_926" name="y" type="_944" offset="64" context="_717" access="public" location="f4:306" file="f4" line="306"/>
  <Field id="_927" name="x" type="_811" offset="0" context="_799" access="public" location="f4:288" file="f4" line="288"/>
  <Field id="_928" name="x" type="_811" offset="0" context="_801" access="public" location="f4:300" file="f4" line="300"/>
  <Field id="_929" name="y" type="_811" offset="64" context="_801" access="public" location="f4:300" file="f4" line="300"/>
  <ReferenceType id="_934" type="_38c" size="64" align="64"/>
  <FundamentalType id="_935" name="long unsigned int" size="64" align="64"/>
  <ReferenceType id="_936" type="_118c" size="64" align="64"/>
  <ReferenceType id="_937" type="_193c" size="64" align="64"/>
  <PointerType id="_938" type="_816" size="64" align="64"/>
  <FundamentalType id="_941" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_942" name="short int" size="16" align="16"/>
  <FundamentalType id="_943" name="signed char" size="8" align="8"/>
  <FundamentalType id="_944" name="long long unsigned int" size="64" align="64"/>
  <FundamentalType id="_945" name="unsigned char" size="8" align="8"/>
  <CvQualifiedType id="_816c" type="_816" const="1"/>
  <CvQualifiedType id="_264c" type="_264" const="1"/>
  <CvQualifiedType id="_237c" type="_237" const="1"/>
  <CvQualifiedType id="_806c" type="_806" const="1"/>
  <CvQualifiedType id="_38c" type="_38" const="1"/>
  <CvQualifiedType id="_193c" type="_193" const="1"/>
  <CvQualifiedType id="_118c" type="_118" const="1"/>
  <CvQualifiedType id="_531c" type="_531" const="1"/>
  <CvQualifiedType id="_119c" type="_119" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.1/gccxml_builtins.h"/>
  <File id="f1" name="/usr/include/bits/mathcalls.h"/>
  <File id="f2" name="/usr/local/cuda/include/cublas.h"/>
  <File id="f3" name="/usr/local/cuda/include/cuComplex.h"/>
  <File id="f4" name="/usr/local/cuda/include/vector_types.h"/>
  <File id="f5" name="/usr/include/math.h"/>
  <File id="f6" name="/usr/include/bits/mathdef.h"/>
  <CPP_DUMP name="functions"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="aliases"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="excluded"><![CDATA[]]></CPP_DUMP>
</GCC_XML>
