<?xml version="1.0"?>
<GCC_XML cvs_revision="1.127">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _7 _8 _10 _11 _12 _13 _14 _15 _16 _17 _18 _20 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _42 _43 _44 _46 _47 _48 _49 _50 _51 _52 _21 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _64 _65 _66 _67 _68 _69 _70 _71 _41 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _140 _141 _142 _144 _145 _146 _147 _19 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _2 _159 _160 _161 _162 _163 _164 _165 _166 _167 _139 _168 _170 _172 _173 _174 _175 _176 _177 _178 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _210 _171 _179 _211 _212 _213 _214 _215 _217 _218 _219 _220 _222 _223 _224 _225 _226 _227 _229 _230 _231 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250 _251 _252 _253 _254 _255 _256 _257 _258 _9 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>

    <Argument name="pPitch" type="_282" location="f1:279" file="f1" line="279"/>
    <Argument name="WidthInBytes" type="_116" location="f1:279" file="f1" line="279"/>
    <Argument name="Height" type="_116" location="f1:279" file="f1" line="279"/>
    <Argument name="ElementSizeBytes" type="_116" location="f1:279" file="f1" line="279"/>
  </Function>
  <Function id="_241" name="__builtin_ctzll" returns="_216" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_281" location="f0:98" file="f0" line="98"/>
  </Function>
  <Function id="_242" name="__builtin_cargf" returns="_262" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_283" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_243" name="__builtin_cargl" returns="_264" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_284" location="f0:95" file="f0" line="95"/>
  </Function>
  <Function id="_244" name="__builtin_cosf" returns="_262" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_262" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_245" name="__builtin_cosh" returns="_259" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow pure no vops">
    <Argument type="_259" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_246" name="__builtin_cosl" returns="_264" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_264" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_247" name="cuMemsetD2D32" returns="_136" context="_1" location="f1:409" file="f1" line="409" extern="1">
    <Argument name="dstDevice" type="_117" location="f1:409" file="f1" line="409"/>
    <Argument name="dstPitch" type="_116" location="f1:409" file="f1" line="409"/>
    <Argument name="ui" type="_116" location="f1:409" file="f1" line="409"/>
    <Argument name="Width" type="_116" location="f1:409" file="f1" line="409"/>
    <Argument name="Height" type="_116" location="f1:409" file="f1" line="409"/>
  </Function>
  <Function id="_248" name="cuEventCreate" returns="_136" context="_1" location="f1:533" file="f1" line="533" extern="1">
    <Argument name="phEvent" type="_378" location="f1:533" file="f1" line="533"/>
    <Argument name="Flags" type="_116" location="f1:533" file="f1" line="533"/>
  </Function>
  <Function id="_249" name="cuModuleUnload" returns="_136" context="_1" location="f1:258" file="f1" line="258" extern="1">
    <Argument name="hmod" type="_229" location="f1:258" file="f1" line="258"/>
  </Function>
  <Function id="_250" name="cuParamSetf" returns="_136" context="_1" location="f1:511" file="f1" line="511" extern="1">
    <Argument name="hfunc" type="_46" location="f1:511" file="f1" line="511"/>
    <Argument name="offset" type="_216" location="f1:511" file="f1" line="511"/>
    <Argument name="value" type="_262" location="f1:511" file="f1" line="511"/>
  </Function>
  <Function id="_251" name="cuCtxPopCurrent" returns="_136" context="_1" location="f1:244" file="f1" line="244" extern="1">
    <Argument name="pctx" type="_375" location="f1:244" file="f1" line="244"/>
  </Function>
  <Function id="_252" name="cuParamSeti" returns="_136" context="_1" location="f1:510" file="f1" line="510" extern="1">
    <Argument name="hfunc" type="_46" location="f1:510" file="f1" line="510"/>
    <Argument name="offset" type="_216" location="f1:510" file="f1" line="510"/>
    <Argument name="value" type="_116" location="f1:510" file="f1" line="510"/>
  </Function>
  <Function id="_253" name="cuParamSetv" returns="_136" context="_1" location="f1:512" file="f1" line="512" extern="1">
    <Argument name="hfunc" type="_46" location="f1:512" file="f1" line="512"/>
    <Argument name="offset" type="_216" location="f1:512" file="f1" line="512"/>
    <Argument name="ptr" type="_287" location="f1:512" file="f1" line="512"/>
    <Argument name="numbytes" type="_116" location="f1:512" file="f1" line="512"/>
  </Function>
  <Function id="_254" name="cuParamSetTexRef" returns="_136" context="_1" location="f1:513" file="f1" line="513" extern="1">
    <Argument name="hfunc" type="_46" location="f1:513" file="f1" line="513"/>
    <Argument name="texunit" type="_216" location="f1:513" file="f1" line="513"/>
    <Argument name="hTexRef" type="_170" location="f1:513" file="f1" line="513"/>
  </Function>
  <Function id="_255" name="__builtin_sinf" returns="_262" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_262" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_256" name="__builtin_sinh" returns="_259" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow pure no vops">
    <Argument type="_259" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_257" name="__builtin_sinl" returns="_264" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_264" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_258" name="__builtin_csin" returns="_286" context="_1" mangled="csin" location="f0:112" file="f0" line="112" extern="1" attributes="nothrow pure no vops">
    <Argument type="_286" location="f0:112" file="f0" line="112"/>
  </Function>
  <FundamentalType id="_259" name="double" size="64" align="64"/>
  <PointerType id="_260" type="_379c" size="32" align="32"/>
  <PointerType id="_261" type="_20" size="32" align="32"/>
  <FundamentalType id="_262" name="float" size="32" align="32"/>
  <PointerType id="_263" type="_42c" size="32" align="32"/>
  <FundamentalType id="_264" name="long double" size="128" align="128"/>
  <Field id="_265" name="maxThreadsPerBlock" type="_216" offset="0" context="_8" access="public" location="f1:141" file="f1" line="141"/>
  <Field id="_266" name="maxThreadsDim" type="_382" offset="32" context="_8" access="public" location="f1:142" file="f1" line="142"/>
  <Field id="_267" name="maxGridSize" type="_382" offset="128" context="_8" access="public" location="f1:143" file="f1" line="143"/>
  <Field id="_268" name="sharedMemPerBlock" type="_216" offset="224" context="_8" access="public" location="f1:144" file="f1" line="144"/>
  <Field id="_269" name="totalConstantMemory" type="_216" offset="256" context="_8" access="public" location="f1:145" file="f1" line="145"/>
  <Field id="_270" name="SIMDWidth" type="_216" offset="288" context="_8" access="public" location="f1:146" file="f1" line="146"/>
  <Field id="_271" name="memPitch" type="_216" offset="320" context="_8" access="public" location="f1:147" file="f1" line="147"/>
  <Field id="_272" name="regsPerBlock" type="_216" offset="352" context="_8" access="public" location="f1:148" file="f1" line="148"/>
  <Field id="_273" name="clockRate" type="_216" offset="384" context="_8" access="public" location="f1:149" file="f1" line="149"/>
  <Field id="_274" name="textureAlign" type="_216" offset="416" context="_8" access="public" location="f1:150" file="f1" line="150"/>
  <Destructor id="_275" name="CUdevprop_st" artificial="1" throw="" context="_8" access="public" mangled="_ZN12CUdevprop_stD1Ev *INTERNAL* " demangled="CUdevprop_st::~CUdevprop_st()" location="f1:140" file="f1" line="140" endline="140" inline="1">
  </Destructor>
  <OperatorMethod id="_276" name="=" returns="_383" artificial="1" throw="" context="_8" access="public" mangled="_ZN12CUdevprop_staSERKS_" demangled="CUdevprop_st::operator=(CUdevprop_st const&amp;)" location="f1:140" file="f1" line="140" endline="140" inline="1">
    <Argument type="_384" location="f1:140" file="f1" line="140"/>
  </OperatorMethod>
  <Constructor id="_277" name="CUdevprop_st" artificial="1" throw="" context="_8" access="public" mangled="_ZN12CUdevprop_stC1ERKS_ *INTERNAL* " demangled="CUdevprop_st::CUdevprop_st(CUdevprop_st const&amp;)" location="f1:140" file="f1" line="140" endline="140" inline="1">
    <Argument type="_384" location="f1:140" file="f1" line="140"/>
  </Constructor>
  <Constructor id="_278" name="CUdevprop_st" artificial="1" throw="" context="_8" access="public" mangled="_ZN12CUdevprop_stC1Ev *INTERNAL* " demangled="CUdevprop_st::CUdevprop_st()" location="f1:140" file="f1" line="140" inline="1"/>
  <PointerType id="_279" type="_229" size="32" align="32"/>
  <PointerType id="_280" type="_340c" size="32" align="32"/>
  <FundamentalType id="_281" name="long long int" size="64" align="64"/>
  <PointerType id="_282" type="_116" size="32" align="32"/>
  <FundamentalType id="_283" name="complex float" size="64" align="32"/>
  <FundamentalType id="_284" name="complex long double" size="256" align="128"/>
  <PointerType id="_285" type="_117" size="32" align="32"/>
  <FundamentalType id="_286" name="complex double" size="128" align="64"/>
  <PointerType id="_287" type="_340" size="32" align="32"/>
  <Field id="_288" name="srcXInBytes" type="_116" offset="0" context="_41" access="public" location="f1:318" file="f1" line="318"/>
  <Field id="_289" name="srcY" type="_116" offset="32" context="_41" access="public" location="f1:318" file="f1" line="318"/>
  <Field id="_290" name="srcMemoryType" type="_22" offset="64" context="_41" access="public" location="f1:319" file="f1" line="319"/>
  <Field id="_291" name="srcHost" type="_280" offset="96" context="_41" access="public" location="f1:320" file="f1" line="320"/>
  <Field id="_292" name="srcDevice" type="_117" offset="128" context="_41" access="public" location="f1:321" file="f1" line="321"/>
  <Field id="_293" name="srcArray" type="_144" offset="160" context="_41" access="public" location="f1:322" file="f1" line="322"/>
  <Field id="_294" name="srcPitch" type="_116" offset="192" context="_41" access="public" location="f1:323" file="f1" line="323"/>
  <Field id="_295" name="dstXInBytes" type="_116" offset="224" context="_41" access="public" location="f1:325" file="f1" line="325"/>
  <Field id="_296" name="dstY" type="_116" offset="256" context="_41" access="public" location="f1:325" file="f1" line="325"/>
  <Field id="_297" name="dstMemoryType" type="_22" offset="288" context="_41" access="public" location="f1:326" file="f1" line="326"/>
  <Field id="_298" name="dstHost" type="_287" offset="320" context="_41" access="public" location="f1:327" file="f1" line="327"/>
  <Field id="_299" name="dstDevice" type="_117" offset="352" context="_41" access="public" location="f1:328" file="f1" line="328"/>
  <Field id="_300" name="dstArray" type="_144" offset="384" context="_41" access="public" location="f1:329" file="f1" line="329"/>
  <Field id="_301" name="dstPitch" type="_116" offset="416" context="_41" access="public" location="f1:330" file="f1" line="330"/>
  <Field id="_302" name="WidthInBytes" type="_116" offset="448" context="_41" access="public" location="f1:332" file="f1" line="332"/>
  <Field id="_303" name="Height" type="_116" offset="480" context="_41" access="public" location="f1:333" file="f1" line="333"/>
  <Destructor id="_304" name="CUDA_MEMCPY2D_st" artificial="1" throw="" context="_41" access="public" mangled="_ZN16CUDA_MEMCPY2D_stD1Ev *INTERNAL* " demangled="CUDA_MEMCPY2D_st::~CUDA_MEMCPY2D_st()" location="f1:316" file="f1" line="316" endline="316" inline="1">
  </Destructor>
  <OperatorMethod id="_305" name="=" returns="_386" artificial="1" throw="" context="_41" access="public" mangled="_ZN16CUDA_MEMCPY2D_staSERKS_" demangled="CUDA_MEMCPY2D_st::operator=(CUDA_MEMCPY2D_st const&amp;)" location="f1:316" file="f1" line="316" endline="316" inline="1">
    <Argument type="_387" location="f1:316" file="f1" line="316"/>
  </OperatorMethod>
  <Constructor id="_306" name="CUDA_MEMCPY2D_st" artificial="1" throw="" context="_41" access="public" mangled="_ZN16CUDA_MEMCPY2D_stC1ERKS_ *INTERNAL* " demangled="CUDA_MEMCPY2D_st::CUDA_MEMCPY2D_st(CUDA_MEMCPY2D_st const&amp;)" location="f1:316" file="f1" line="316" endline="316" inline="1">
    <Argument type="_387" location="f1:316" file="f1" line="316"/>
  </Constructor>
  <Constructor id="_307" name="CUDA_MEMCPY2D_st" artificial="1" throw="" context="_41" access="public" mangled="_ZN16CUDA_MEMCPY2D_stC1Ev *INTERNAL* " demangled="CUDA_MEMCPY2D_st::CUDA_MEMCPY2D_st()" location="f1:316" file="f1" line="316" inline="1"/>
  <PointerType id="_308" type="_217" size="32" align="32"/>
  <PointerType id="_309" type="_144" size="32" align="32"/>
  <PointerType id="_310" type="_171c" size="32" align="32"/>
  <Field id="_311" name="srcXInBytes" type="_116" offset="0" context="_51" access="public" location="f1:342" file="f1" line="342"/>
  <Field id="_312" name="srcY" type="_116" offset="32" context="_51" access="public" location="f1:342" file="f1" line="342"/>
  <Field id="_313" name="srcZ" type="_116" offset="64" context="_51" access="public" location="f1:342" file="f1" line="342"/>
  <Field id="_314" name="srcLOD" type="_116" offset="96" context="_51" access="public" location="f1:343" file="f1" line="343"/>
  <Field id="_315" name="srcMemoryType" type="_22" offset="128" context="_51" access="public" location="f1:344" file="f1" line="344"/>
  <Field id="_316" name="srcHost" type="_280" offset="160" context="_51" access="public" location="f1:345" file="f1" line="345"/>
  <Field id="_317" name="srcDevice" type="_117" offset="192" context="_51" access="public" location="f1:346" file="f1" line="346"/>
  <Field id="_318" name="srcArray" type="_144" offset="224" context="_51" access="public" location="f1:347" file="f1" line="347"/>
  <Field id="_319" name="reserved0" type="_287" offset="256" context="_51" access="public" location="f1:348" file="f1" line="348"/>
  <Field id="_320" name="srcPitch" type="_116" offset="288" context="_51" access="public" location="f1:349" file="f1" line="349"/>
  <Field id="_321" name="srcHeight" type="_116" offset="320" context="_51" access="public" location="f1:350" file="f1" line="350"/>
  <Field id="_322" name="dstXInBytes" type="_116" offset="352" context="_51" access="public" location="f1:352" file="f1" line="352"/>
  <Field id="_323" name="dstY" type="_116" offset="384" context="_51" access="public" location="f1:352" file="f1" line="352"/>
  <Field id="_324" name="dstZ" type="_116" offset="416" context="_51" access="public" location="f1:352" file="f1" line="352"/>
  <Field id="_325" name="dstLOD" type="_116" offset="448" context="_51" access="public" location="f1:353" file="f1" line="353"/>
  <Field id="_326" name="dstMemoryType" type="_22" offset="480" context="_51" access="public" location="f1:354" file="f1" line="354"/>
  <Field id="_327" name="dstHost" type="_287" offset="512" context="_51" access="public" location="f1:355" file="f1" line="355"/>
  <Field id="_328" name="dstDevice" type="_117" offset="544" context="_51" access="public" location="f1:356" file="f1" line="356"/>
  <Field id="_329" name="dstArray" type="_144" offset="576" context="_51" access="public" location="f1:357" file="f1" line="357"/>
  <Field id="_330" name="reserved1" type="_287" offset="608" context="_51" access="public" location="f1:358" file="f1" line="358"/>
  <Field id="_331" name="dstPitch" type="_116" offset="640" context="_51" access="public" location="f1:359" file="f1" line="359"/>
  <Field id="_332" name="dstHeight" type="_116" offset="672" context="_51" access="public" location="f1:360" file="f1" line="360"/>
  <Field id="_333" name="WidthInBytes" type="_116" offset="704" context="_51" access="public" location="f1:362" file="f1" line="362"/>
  <Field id="_334" name="Height" type="_116" offset="736" context="_51" access="public" location="f1:363" file="f1" line="363"/>
  <Field id="_335" name="Depth" type="_116" offset="768" context="_51" access="public" location="f1:364" file="f1" line="364"/>
  <Destructor id="_336" name="CUDA_MEMCPY3D_st" artificial="1" throw="" context="_51" access="public" mangled="_ZN16CUDA_MEMCPY3D_stD1Ev *INTERNAL* " demangled="CUDA_MEMCPY3D_st::~CUDA_MEMCPY3D_st()" location="f1:340" file="f1" line="340" endline="340" inline="1">
  </Destructor>
  <OperatorMethod id="_337" name="=" returns="_389" artificial="1" throw="" context="_51" access="public" mangled="_ZN16CUDA_MEMCPY3D_staSERKS_" demangled="CUDA_MEMCPY3D_st::operator=(CUDA_MEMCPY3D_st const&amp;)" location="f1:340" file="f1" line="340" endline="340" inline="1">
    <Argument type="_390" location="f1:340" file="f1" line="340"/>
  </OperatorMethod>
  <Constructor id="_338" name="CUDA_MEMCPY3D_st" artificial="1" throw="" context="_51" access="public" mangled="_ZN16CUDA_MEMCPY3D_stC1ERKS_ *INTERNAL* " demangled="CUDA_MEMCPY3D_st::CUDA_MEMCPY3D_st(CUDA_MEMCPY3D_st const&amp;)" location="f1:340" file="f1" line="340" endline="340" inline="1">
    <Argument type="_390" location="f1:340" file="f1" line="340"/>
  </Constructor>
  <Constructor id="_339" name="CUDA_MEMCPY3D_st" artificial="1" throw="" context="_51" access="public" mangled="_ZN16CUDA_MEMCPY3D_stC1Ev *INTERNAL* " demangled="CUDA_MEMCPY3D_st::CUDA_MEMCPY3D_st()" location="f1:340" file="f1" line="340" inline="1"/>
  <FundamentalType id="_340" name="void" align="8"/>
  <PointerType id="_341" type="_216" size="32" align="32"/>
  <FundamentalType id="_342" name="unsigned char" size="8" align="8"/>
  <PointerType id="_343" type="_174" size="32" align="32"/>
  <PointerType id="_344" type="_233" size="32" align="32"/>
  <PointerType id="_345" type="_379" size="32" align="32"/>
  <PointerType id="_346" type="_171" size="32" align="32"/>
  <PointerType id="_347" type="_46" size="32" align="32"/>
  <PointerType id="_348" type="_73" size="32" align="32"/>
  <FundamentalType id="_349" name="long int" size="32" align="32"/>
  <FundamentalType id="_350" name="short unsigned int" size="16" align="16"/>
  <PointerType id="_351" type="_262" size="32" align="32"/>
  <PointerType id="_352" type="_264" size="32" align="32"/>
  <PointerType id="_353" type="_188c" size="32" align="32"/>
  <PointerType id="_354" type="_199" size="32" align="32"/>
  <PointerType id="_355" type="_170" size="32" align="32"/>
  <Field id="_356" name="Width" type="_116" offset="0" context="_171" access="public" location="f1:432" file="f1" line="432"/>
  <Field id="_357" name="Height" type="_116" offset="32" context="_171" access="public" location="f1:433" file="f1" line="433"/>
  <Field id="_358" name="Format" type="_174" offset="64" context="_171" access="public" location="f1:438" file="f1" line="438"/>
  <Field id="_359" name="NumChannels" type="_116" offset="96" context="_171" access="public" location="f1:441" file="f1" line="441"/>
  <Destructor id="_360" name="$_0" artificial="1" throw="" context="_171" access="public" mangled="_ZN21CUDA_ARRAY_DESCRIPTORD1Ev *INTERNAL* " demangled="CUDA_ARRAY_DESCRIPTOR::~CUDA_ARRAY_DESCRIPTOR()" location="f1:442" file="f1" line="442" endline="442" inline="1">
  </Destructor>
  <OperatorMethod id="_361" name="=" returns="_392" artificial="1" throw="" context="_171" access="public" mangled="_ZN21CUDA_ARRAY_DESCRIPTORaSERKS_" demangled="CUDA_ARRAY_DESCRIPTOR::operator=(CUDA_ARRAY_DESCRIPTOR const&amp;)" location="f1:442" file="f1" line="442" endline="442" inline="1">
    <Argument type="_393" location="f1:428" file="f1" line="428"/>
  </OperatorMethod>
  <Constructor id="_362" name="$_0" artificial="1" throw="" context="_171" access="public" mangled="_ZN21CUDA_ARRAY_DESCRIPTORC1ERKS_ *INTERNAL* " demangled="CUDA_ARRAY_DESCRIPTOR::CUDA_ARRAY_DESCRIPTOR(CUDA_ARRAY_DESCRIPTOR const&amp;)" location="f1:442" file="f1" line="442" endline="442" inline="1">
    <Argument type="_393" location="f1:428" file="f1" line="428"/>
  </Constructor>
  <Constructor id="_363" name="$_0" artificial="1" throw="" context="_171" access="public" mangled="_ZN21CUDA_ARRAY_DESCRIPTORC1Ev *INTERNAL* " demangled="CUDA_ARRAY_DESCRIPTOR::CUDA_ARRAY_DESCRIPTOR()" location="f1:442" file="f1" line="442" inline="1"/>
  <Field id="_364" name="Width" type="_116" offset="0" context="_179" access="public" location="f1:453" file="f1" line="453"/>
  <Field id="_365" name="Height" type="_116" offset="32" context="_179" access="public" location="f1:454" file="f1" line="454"/>
  <Field id="_366" name="Depth" type="_116" offset="64" context="_179" access="public" location="f1:455" file="f1" line="455"/>
  <Field id="_367" name="Format" type="_174" offset="96" context="_179" access="public" location="f1:459" file="f1" line="459"/>
  <Field id="_368" name="NumChannels" type="_116" offset="128" context="_179" access="public" location="f1:462" file="f1" line="462"/>
  <Field id="_369" name="Flags" type="_116" offset="160" context="_179" access="public" location="f1:466" file="f1" line="466"/>
  <Destructor id="_370" name="$_1" artificial="1" throw="" context="_179" access="public" mangled="_ZN23CUDA_ARRAY3D_DESCRIPTORD1Ev *INTERNAL* " demangled="CUDA_ARRAY3D_DESCRIPTOR::~CUDA_ARRAY3D_DESCRIPTOR()" location="f1:468" file="f1" line="468" endline="468" inline="1">
  </Destructor>
  <OperatorMethod id="_371" name="=" returns="_394" artificial="1" throw="" context="_179" access="public" mangled="_ZN23CUDA_ARRAY3D_DESCRIPTORaSERKS_" demangled="CUDA_ARRAY3D_DESCRIPTOR::operator=(CUDA_ARRAY3D_DESCRIPTOR const&amp;)" location="f1:468" file="f1" line="468" endline="468" inline="1">
    <Argument type="_395" location="f1:449" file="f1" line="449"/>
  </OperatorMethod>
  <Constructor id="_372" name="$_1" artificial="1" throw="" context="_179" access="public" mangled="_ZN23CUDA_ARRAY3D_DESCRIPTORC1ERKS_ *INTERNAL* " demangled="CUDA_ARRAY3D_DESCRIPTOR::CUDA_ARRAY3D_DESCRIPTOR(CUDA_ARRAY3D_DESCRIPTOR const&amp;)" location="f1:468" file="f1" line="468" endline="468" inline="1">
    <Argument type="_395" location="f1:449" file="f1" line="449"/>
  </Constructor>
  <Constructor id="_373" name="$_1" artificial="1" throw="" context="_179" access="public" mangled="_ZN23CUDA_ARRAY3D_DESCRIPTORC1Ev *INTERNAL* " demangled="CUDA_ARRAY3D_DESCRIPTOR::CUDA_ARRAY3D_DESCRIPTOR()" location="f1:468" file="f1" line="468" inline="1"/>
  <PointerType id="_374" type="_179" size="32" align="32"/>
  <PointerType id="_375" type="_222" size="32" align="32"/>
  <PointerType id="_376" type="_179c" size="32" align="32"/>
  <PointerType id="_377" type="_287" size="32" align="32"/>
  <PointerType id="_378" type="_64" size="32" align="32"/>
  <ArrayType id="_382" min="0" max="2u" type="_216" size="96" align="32"/>
  <ReferenceType id="_383" type="_8" size="32" align="32"/>
  <ReferenceType id="_384" type="_8c" size="32" align="32"/>
  <ReferenceType id="_386" type="_41" size="32" align="32"/>
  <ReferenceType id="_387" type="_41c" size="32" align="32"/>
  <ReferenceType id="_389" type="_51" size="32" align="32"/>
  <ReferenceType id="_390" type="_51c" size="32" align="32"/>
  <ReferenceType id="_392" type="_171" size="32" align="32"/>
  <ReferenceType id="_393" type="_171c" size="32" align="32"/>
  <ReferenceType id="_394" type="_179" size="32" align="32"/>
  <ReferenceType id="_395" type="_179c" size="32" align="32"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <CvQualifiedType id="_41c" type="_41" const="1"/>
  <CvQualifiedType id="_42c" type="_42" const="1"/>
  <CvQualifiedType id="_51c" type="_51" const="1"/>
  <CvQualifiedType id="_188c" type="_188" const="1"/>
  <CvQualifiedType id="_171c" type="_171" const="1"/>
  <CvQualifiedType id="_179c" type="_179" const="1"/>
  <FundamentalType id="_379" name="char" size="8" align="8"/>
  <CvQualifiedType id="_379c" type="_379" const="1"/>
  <CvQualifiedType id="_340c" type="_340" const="1"/>
  <File id="f0" name="/opt/local/share/gccxml-0.9/GCC/4.0/gccxml_builtins.h"/>
  <File id="f1" name="/usr/local/cuda/include/cuda.h"/>
  <CPP_DUMP name="functions"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="aliases"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="excluded"><![CDATA[]]></CPP_DUMP>
</GCC_XML>
